README.org
#+TITLE:   My custom DOOM EMACS Config
#+DATE:    July 23, 2020
#+AUTHOR:  jjpark89@outlook.com

** Table of Contents :TOC_3_gh:
  - [[#initialize][Initialize]]
    - [[#load-config-from-files][Load Config from files]]
    - [[#packages][Packages]]
    - [[#custom-setup][Custom Setup]]
    - [[#useful-bindings][Useful Bindings]]
  - [[#programming][Programming]]
    - [[#ccls-custom-setting][CCLS Custom Setting]]
    - [[#vue--typescript-custom-setting][Vue & Typescript Custom Setting]]
  - [[#magit--forge][Magit / Forge]]
  - [[#org-mode][Org-Mode]]
  - [[#rss-feed][RSS Feed]]
    - [[#custom-elfeed-search-column][Custom Elfeed Search Column]]
  - [[#utils][Utils]]
    - [[#ripgrep][Ripgrep]]
    - [[#google-stackoverflow-search][Google, StackOverFlow Search]]
    - [[#forge-custom-open-link][Forge Custom Open Link]]
    - [[#toggle-window-layout][Toggle Window Layout]]
  - [[#etc][ETC]]
    - [[#shell-utils][Shell Utils]]
    - [[#custom-variables][Custom Variables]]

** Initialize
*** Load Config from files
우선 한곳에 모든 설정들을 모아두면 알아보기 힘드니 대략적인 기능별로
파일을 나누어 관리한다.
#+BEGIN_SRC elisp :tangle config.el
(load! "+custom_funcs")
(load! "+private")
#+END_SRC
+private.el 파일에는 공개하기 곤란한 개인 토큰이나 패스워드등이 담겨 있다.
*** Packages
#+BEGIN_SRC elisp :tangle packages.el
(package! rainbow-delimiters)
(package! expand-region)
(package! dotenv-mode)
(package! wakatime-mode)
(package! company-tabnine)
(package! org-super-agenda)
(package! org-bullets)
(package! gitlab-ci-mode)
(package! beacon)
(package! carbon-now-sh)
(package! google-this)
(package! rg)
(package! swiper)
(package! magit-delta)
(package! exec-path-from-shell)
(package! evil-matchit)
(package! evil-textobj-anyblock)
(package! lsp-treemacs)
(package! git-link)
(package! magit-todos)
(package! tmux-pane)
(package! npm-mode)
(package! org-jira)
(package! nyan-mode)
(package! platformio-mode)
#+END_SRC
*** Custom Setup
**** Startup Setup
이맥스 관련 일반적인 사항들을 지정한다.
주로 특정 모드가 아닌 이맥스에 글로벌 설정들이 포함된다.
#+BEGIN_SRC elisp :tangle config.el
;; 사용자 이름 설정
(setq user-full-name "Jaejin Park"
      user-mail-address "jjpark78@gmail.com")
(setq-default frame-title-format '("DOOM EMACS"))
(setq auth-sources '("~/.authinfo"))
;; 바쁘게 버퍼전환 하는 와중에 화면이 울렁거리는게 멀미날것 같아서 프리뷰 옵션을 껐다
(setq +ivy-buffer-preview nil)
(setq avy-all-windows t)
(setq ivy-read-action-function #'ivy-hydra-read-action)
;; dired를 두개 열어 놓고 왔다 갔다하며 복사 붙여넣기 할때 편하다
;; (setq dired-dwim-target t)

(setq confirm-kill-emacs nil)
(setq which-key-idle-delay 0.5)
(setq which-key-allow-multiple-replacements t)
(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
   ))

;; 수동으로 직접 프레임 위치를 지정해줘 본다.
;; (setq initial-frame-alist '((top . 23) (left . 1175) (width . 125) (height . 80)))

(global-evil-matchit-mode)

;; 스나이프를 화면 보이는 영역으로 제한한다.
(setq evil-snipe-scope 'whole-visible)
(setq evil-snipe-repeat-scope 'whole-visible)

;; 와카타임이라고 본인이 얼마나 열심히 일했는지
;; 하루 일과를 잘 보여준다.
;; 개인으로만 쓰면 공짜인것도 매력임.
(global-wakatime-mode)

;; just for fun
(nyan-mode)
(nyan-start-animation)
#+END_SRC

**** UTF & Korean Input
한글 관련 설정
#+BEGIN_SRC elisp :tangle config.el
;; 한글 입력기 on
(setq default-input-method "korean-hangul")
(set-language-environment "Korean")
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
;; (set-default-coding-systems 'utf-8)               ; Default to utf-8 encoding
(require 'ucs-normalize)
(set-file-name-coding-system 'utf-8-hfs)
#+END_SRC

**** UIs
이맥스의 ui설정에 관련된 사항.
#+BEGIN_SRC elisp :tangle config.el
;; 이것 저것 많이 바꿔봤지만 역시 기본 테마가 젤 이쁘다
(setq doom-theme 'doom-nord)

;; 노안이 왔는지 이제는 이정도 폰트 크기는 되어야 잘 보임
(setq doom-font (font-spec :family "FiraMono NF" :size 14))

(set-fringe-style '(nil . 0))

;; 한글 관련 폰트 스케일링 설정
;; (set-face-attribute 'default nil :height 130)
;; (set-fontset-font t 'hangul (font-spec :name "AppleGothic"))
;; (set-fontset-font t 'japanese-jisx0213.2004-1 (font-spec :name "AppleGothic"))
;; (set-fontset-font t 'katakana-jisx0201 (font-spec :name "AppleGothic"))

(setq face-font-rescale-alist
      '(("NanumGothicCoding" . 1.2307692307692308)
        ("AppleGothic" . 1.2307692307692308)
        ))
#+END_SRC

**** Doom Modeline
Doom modeline 관련 수정
#+BEGIN_SRC elisp :tangle config.el
(after! doom-modeline
  (setq
    doom-modeline-major-mode-icon t
    doom-modeline-buffer-encoding nil
    doom-modeline-mu4e t
    doom-modeline-buffer-file-name-style 'truncate-with-project))
#+END_SRC

**** Fine-tune
이맥스를 맥과 고해상도(FHD이상의 해상도)에서 쓰다보면 스크롤이 엄청 느려지는 경우가 있다.
여러 이슈들을 확인한 결과 어쩔수 없다 함.
해당 현상을 완화하는데 조금이나마 도움이 된다하여서
구글링을 통해 찾은 각종 튜닝들을 여기다가 넣어 놓았다.
#+BEGIN_SRC elisp :tangle config.el

;; 라인 넘버표시 하지 않는게 더 빠르다
;; 이유는 모름.
(setq display-line-numbers-type 'relative)
;; (setq display-line-numbers-type t)
;; (setq display-line-numbers-type nil)

;; 필요없는 부분은 동작하지 않는 특수 모드 활성화
(global-so-long-mode 1)

;; 더블버퍼링이 동작하도록 설정한다.
(add-to-list 'default-frame-alist '(inhibit-double-buffering . t))
(setq scroll-conservatively 101)

;; lsp 관련 설정 메뉴들
;; 이맥스를 느리게 만드는 범인중 십중팔구 LSP가 관련되어져 있다고 함.
;; 해당 튜닝도 구글링을 통해서 찾았다.
(setq gc-cons-threshold 1000000000)
(setq read-process-output-max (* 1024 1024))
#+END_SRC

*** Useful Bindings
**** Bindings 1
단축키 설정
#+BEGIN_SRC elisp :tangle config.el
;; (map! "C-h" #'tmux-pane-omni-window-left)
;; (map! "C-j" #'tmux-pane-omni-window-down)
;; (map! "C-k" #'tmux-pane-omni-window-up)
;; (map! "C-l" #'tmux-pane-omni-window-right)
(map! "C-h" #'evil-window-left)
(map! "C-j" #'evil-window-down)
(map! "C-k" #'evil-window-up)
(map! "C-l" #'evil-window-right)
(map! :leader :prefix "g" :desc "ediff style diff from working-tree" "d" #'magit-ediff-show-working-tree)
;; go back, go references
(map! :n "gb" #'evil-jump-backward)
(map! :n "gr" #'+lookup/references)
;; 검색할때 브라우저를 찾는 수고를 줄여 준다.
(map! :leader :prefix "s" :desc "Search Google.com" "g" #'google-search)
(map! :leader :prefix "s" :desc "Search StackOverFlow" "v" #'stackoverflow-search)
(map! :leader :prefix "s" :desc "Search Buffers" "b" #'swiper-all)
(map! :leader :prefix "s" :desc "new project search file" "p" #'rg-project)
;; 가끔씩 즐겨보는 블로그들의 rss를 피드로 받아와서 읽을때 사용한다.
(map! :leader :prefix "o" :desc "Open news form RSS with ELfeed" "n" #'elfeed)
(map! :leader :prefix "o" :desc "Open mu4e to current window" "m" #'mu4e)
;; 버퍼끼리 화면 전환할때 프로젝트를 벗어 나지 않도록 강제한다.
(map! :leader :desc "workspace buffer list" "," #'+ivy/switch-workspace-buffer)
;; ORG 모드에서 쓰는 단축키들
(map! :leader :desc "Tangle Export" "ee" #'org-babel-tangle)
;; 커스텀 함수로 정의해둔 쉘 설정 파일불러오는 함수에게 단축기를 할당했음.
;; 자주 쓰지는 않는데 있어보이는 척 할때 아주 좋다.
(map! :leader :prefix "f" :desc "Open Shell init file on other windows" "i" #'er-find-shell-init-file)
(map! :leader :prefix "f" :desc "Open alacritty init file on other windows" "a" #'er-find-alacritty-init-file)
;; 코드를 입력받아서 이쁜 화면으로 만들어주는 패키지에 단축기를 할당했다.
(map! :leader :prefix "t" :desc "Capture Code with Carbon now" "t" #'carbon-now-sh)
;; change window split mode
;; 이맥스를 넓게 쓰다가 길게 쓰다가 할때마다 자주 쓰이는 레이아웃 번경 맛집 함수
(map! :leader :prefix "t" :desc "Toggle Window Split Style" "s" #'toggle-window-split)
;; ace-window
(map! :leader :prefix "w" :desc "open ace window to select window" "a" #'ace-window)
;; evil 에서 라인 처음과 마지막으로 더 빨리 점프할 수 있도록 한다.
(map! :leader :prefix "c" :desc "run npm script" "n" #'npm-mode-npm-run)
(define-key evil-visual-state-map (kbd "H") 'beginning-of-line-text)
(define-key evil-visual-state-map (kbd "L") 'evil-end-of-line)
(define-key evil-normal-state-map (kbd "H") 'beginning-of-line-text)
(define-key evil-normal-state-map (kbd "L") 'evil-end-of-line)
;; evil multi edit recommanded setting
(define-key evil-visual-state-map (kbd "M-s-m") 'evil-multiedit-match-all)
(define-key evil-normal-state-map (kbd "M-s-m") 'evil-multiedit-match-all)
(define-key evil-insert-state-map (kbd "M-s-m") 'evil-multiedit-match-all)
;; 블럭 단위로 한번에 선택하고 싶을때 사용하면 좋다.
;; 기본 단축키가 너무 불편해서 변경했다.
(define-key evil-normal-state-map (kbd "M-s-k") #'er/expand-region)
(define-key evil-normal-state-map (kbd "M-s-j") #'er/contract-region)
(define-key evil-insert-state-map (kbd "M-s-k") #'er/expand-region)
(define-key evil-insert-state-map (kbd "M-s-j") #'er/contract-region)
;;ivy 미니 버퍼에서 컨트롤 키로 아이템을 선택하는건 새끼손가락에 죄를 짓는 일이다.
(map! :after ivy :map ivy-minibuffer-map "TAB" 'next-line)
;; ORG 모드에서 헤더 레벨 설정할때 쓰기 편한 단축키
(map! :after org-mode :map org-mode-map ">" 'org-cyclt-level)
;; <SPC> w C-o 는 너무 누르기 힘들지만 이게 의외로 많이 쓰인다. 쓰이지 않는 키 바인딩에 할당해서 더 간단히 만든다.
(map! :leader :prefix "w" :desc "Close Other Windows Fast Binding" "O" 'delete-other-windows)
(map! :leader :n "," 'switch-to-buffer)
#+END_SRC
