README.org
**** Bindings 2
조금 복잡해지는 바인딩들. 그래도 이것들이 있어서 편하다.
#+BEGIN_SRC elisp :tangle config.el
;; 둠 이맥스 디스코드 채널에서 고수가 제안한 새로운 바인딩
;; https://discord.com/channels/406534637242810369/695450585758957609/759868990909841438
(after! evil
  (require 'evil-textobj-anyblock)
  (evil-define-text-object my-evil-textobj-anyblock-inner-quote
    (count &optional beg end type)
    "Select the closest outer quote."
    (let ((evil-textobj-anyblock-blocks
           '(("'" . "'")
             ("\"" . "\"")
             ("`" . "`")
             ("“" . "”"))))
      (evil-textobj-anyblock--make-textobj beg end type count nil)))
  (evil-define-text-object my-evil-textobj-anyblock-a-quote
    (count &optional beg end type)
    "Select the closest outer quote."
    (let ((evil-textobj-anyblock-blocks
           '(("'" . "'")
             ("\"" . "\"")
             ("`" . "`")
             ("“" . "”"))))
      (evil-textobj-anyblock--make-textobj beg end type count t)))
  (define-key evil-inner-text-objects-map "q" 'my-evil-textobj-anyblock-inner-quote)
  (define-key evil-outer-text-objects-map "q" 'my-evil-textobj-anyblock-a-quote)
  )

 #+END_SRC

** Programming
*** CCLS Custom Setting
#+begin_src elisp :tangle +custom_funcs.el
(defun custom-cc-mode ()
  "Custom cc-mode make support qml, qmake etc."
  (interactive)
  (platformio-conditionally-enable)
  (setq lsp-prefer-flymake nil
        ccls-executable "/usr/local/bin/ccls"
        lsp-ui-peek-fontify 'always
        lsp-ui-doc-include-signature nil  ; don't include type signature in the child fram
        lsp-ui-sideline-show-symbol nil)  ; don't show symbol on the right of info
  (setq-default flycheck-disabled-checkers '(c/c++-clang c/c++-cppcheck c/c++-gcc)))
#+end_src

*** Vue & Typescript Custom Setting
Vue와 타입스크립트를 위한 커스텀 설정 모드.
#+BEGIN_SRC elisp :tangle +custom_funcs.el
(defun setup-custom-jsts-mode ()
  ;; 기본 인덴테이션을 설정한다.
  (lsp)
  (setq typescript-indent-level 2)
  (setq emmet-indentation 2)
  (setq js-indent-level 2)
  ;; (setq global-git-gutter-mode t)
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-markup-indent-offset 2)
  (flycheck-mode +1)
  (my/use-eslint-from-node-modules)
  (flycheck-add-mode 'javascript-eslint 'web-mode)
  (setq lsp-ui-peek-fontify 'always)
  (setq flycheck-check-syntax-automatically '(save mode-enabled))
  ;; (add-hook 'before-save-hook prettier-js nil 'local)
  ;; (prettier-js-mode)
  )

(defun custom-ts-mode ()
  (if (not (equal buffer-file-name 'nil))
      (let ((extname (file-name-extension buffer-file-name)))
        (when (or (string-equal "tsx" extname)
                  (string-equal "ts" extname))
          (setup-custom-jsts-mode)
          ;; (set-company-backend! 'prog-mode '(company-tabnine company-capf company-yasnippet))
          ;; Optional configuration that hides the background color for a highlighted block
          ;; I find it useful for debugging emacs, but when actually coding I dont want so much emphasis on submodes
          (flycheck-select-checker 'javascript-eslint)))))

(defun my/use-eslint-from-node-modules ()
  "Use local eslint from node_modules before global."
  (let* ((root (locate-dominating-file
                (or (buffer-file-name) default-directory)
                "node_modules"))
         (eslint (and root
                      (expand-file-name "node_modules/eslint/bin/eslint.js"
                                        root))))
    (when (and eslint (file-executable-p eslint))
      (setq-local flycheck-javascript-eslint-executable eslint))))

(defun custom-vue-mode ()
  "Custom hooks for vue-mode"
  (if (not (equal buffer-file-name 'nil))
      (let ((extname (file-name-extension buffer-file-name)))
        (when (string-equal "vue" extname)
          (setup-custom-jsts-mode)
          ;; (set-company-backend! 'prog-mode '(company-tabnine company-capf company-yasnippet))
          (flycheck-select-checker 'javascript-eslint)
          ))))

#+END_SRC

주로 사용하는 언어들 관련 설정. lsp관련 설정들을 모아 놓았다.
#+BEGIN_SRC elisp :tangle config.el
;; 뷰모드가 느리게 동작하고 아직 버그가 많아서 웹 모드로 바꾼다.
(add-to-list 'auto-mode-alist '("\\.vue\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.env\\'" . dotenv-mode))

;; disable CamelCase syntax
(global-subword-mode nil)

;; disable lsp-formating
(setq +format-with-lsp nil)
(setq +format-on-save-enabled-modes
      '(not emacs-lisp-mode
            sql-mode
            tex-mode
            latex-mode))

(add-hook 'web-mode-hook #'format-all-mode)
(add-hook 'cc-mode-hook #'format-all-mode)
(add-hook 'typescript-mode-hook #'format-all-mode)
(add-hook 'typescript-tsx-mode-hook #'format-all-mode)

(add-hook 'web-mode-hook 'custom-vue-mode)
(add-hook 'typescript-mode-hook 'custom-ts-mode)
(add-hook 'typescript-tsx-mode-hook 'custom-ts-mode)
(add-hook 'cc-mode-hook 'custom-cc-mode)
(add-hook 'c++-mode-hook 'custom-cc-mode)

(setq lsp-auto-guess-root t)
;; (after! typescript-mode
;;   (set-company-backend! 'typescript-mode '(company-tabnine company-capf company-yasnippet)))
(setq flycheck-global-modes '(not conf-colon-mode gfm-mode forge-post-mode gitlab-ci-mode dockerfile-mode Org-mode org-mode))

;; all-the-icons에 아이콘 색깔을 바꾸기 위해서 수동으로 설정한다.
;; (add-hook 'company-mode-hook 'company-box-mode)
;; (setq company-box-icons-alist 'company-box-icons-idea)
;; (setq company-tooltip-minimum-width 60)
;; (setq company-tooltip-maximum-width 60)
;; (setq company-box-doc-enable nil)

;; 린트 에러 버퍼를 오픈하면 포커스가 자동으로 이동하지 않는다.
;; 이거 없으면 생각보다 귀찮아진다.
(add-hook 'flycheck-error-list-mode-hook (lambda () (switch-to-buffer-other-window "*Flycheck errors*")))
#+END_SRC

**** LSP & Tabnine
Tabnine관련 설정들
#+BEGIN_SRC elisp :tangle config.el
(after! ccls
  (setq ccls-initialization-options '(:index (:comments 2) :completion (:detailedLabel t)))
  (set-lsp-priority! 'ccls 2)) ; optional as ccls is the default in Doom

(use-package company-tabnine
  :defer 1
  :custom
  (company-tabnine-max-num-results 9)
  :hook
  (lsp-after-open . (lambda ()
                      (setq company-tabnine-max-num-results 5)
                      (add-to-list 'company-transformers 'company//sort-by-tabnine t)
                      (add-to-list 'company-backends '(company-capf :with company-tabnine :separate))))
  (kill-emacs . company-tabnine-kill-process)
  :config
  ;; Enable TabNine on default
  (add-to-list 'company-backends #'company-tabnine)

  ;; Integrate company-tabnine with lsp-mode
  (defun company//sort-by-tabnine (candidates)
    (if (or (functionp company-backend)
            (not (and (listp company-backend) (memq 'company-tabnine company-backends))))
        candidates
      (let ((candidates-table (make-hash-table :test #'equal))
            candidates-lsp
            candidates-tabnine)
        (dolist (candidate candidates)
          (if (eq (get-text-property 0 'company-backend candidate)
                  'company-tabnine)
              (unless (gethash candidate candidates-table)
                (push candidate candidates-tabnine))
            (push candidate candidates-lsp)
            (puthash candidate t candidates-table)))
        (setq candidates-lsp (nreverse candidates-lsp))
        (setq candidates-tabnine (nreverse candidates-tabnine))
        (nconc (seq-take candidates-tabnine 5)
               (seq-take candidates-lsp 6))))))
#+END_SRC

**** Programming ETC
 개발관련 기타 설정들
#+BEGIN_SRC elisp :tangle config.el

;; 1초라도 빨리 팝업 띄우고 싶어서
;; 그러나 실제 체감속도 향상은 없음
(setq company-idle-delay 0.0)

;; Dash Documents랑 연동이 되도록 각각 메이저에 관련 정보들을 추가한다.
(set-docsets! 'c++-mode "Qt" "C++" "C")
(set-docsets! 'cc-mode "Qt" "C++" "C")
(set-docsets! 'web-mode   "TypeScript" "NodeJS" "HTML" "CSS" "Pug" "Stylus" "VueJS")
(set-docsets! 'typescript "TypeScript" "NodeJS" "HTML" "CSS" "Pug" "Stylus" "VueJS")

;; lsp 설정 이후에 불필요한 옵션들은 전부다 끈다.
;; These take up a lot of space on my big font size
(setq lsp-ui-sideline-show-code-actions nil
      lsp-ui-sideline-show-diagnostics nil
      lsp-modeline-diagnostics-mode nil
      lsp-modeline-diagnostics-enable nil
      lsp-signature-render-all nil)
#+END_SRC
