README.org
** Org-Mode

ORG모드를 위한 함수들
#+BEGIN_SRC elisp :tangle +custom_funcs.el
(defun my-org-config/after-org-mode-load ()
  ;; (visual-line-mode)
  (require 'org-indent)
  (org-indent-mode)
  )
#+END_SRC

요즘 열공중인 그렇게 대단하다 침이 마르지 않게 칭찬해대는 ORG모드에 대한 설정들을 따로 모아 놓았다.
#+BEGIN_SRC elisp :tangle config.el
;; start my org settings
;; config some hooks
(after! org
  (add-hook 'org-mode-hook 'my-org-config/after-org-mode-load)
  ;;basic org mode config
  (setq
   org-fontify-quote-and-verse-blocks nil
   org-fontify-whole-heading-line nil
   org-hide-leading-starts nil
   org-startup-indented nil
   org-hide-emphasis-markers t
   org-directory "~/org/"
   org-agenda-skip-scheduled-if-done t
   org-ellipsis " ▾ "
   org-tags-column -80
   org-agenda-span 30
   org-agenda-files '("~/org")
   org-log-done 'time
   org-refile-targets (quote ((nil :maxlevel . 1)))
   +org-capture-todo-file "tasks.org"
   org-edit-src-content-indentation 0
   org-src-tab-acts-natively t
   org-src-preserve-indentation t
   ;; config org-super-agenda
   org-super-agenda-mode t
   org-super-agenda-header-map nil
   org-deadline-warning-days 7
   org-agenda-skip-scheduled-if-done t
   org-agenda-block-separator 9472
   org-agenda-start-on-weekday nil
   org-super-agenda-groups '((:name "Today"
                              :time-grid t
                              :scheduled today)
                             (:name "Due today"
                              :deadline today)
                             (:name "Important"
                              :priority "A")
                             (:name "Overdue"
                              :deadline past)
                             (:name "Due soon"
                              :deadline future)))
  ;; org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕"))
  (set-face-attribute 'org-link nil :weight 'normal :background nil)
  (set-face-attribute 'org-code nil :foreground "#a9a1e1" :background nil)
  (set-face-attribute 'org-date nil :foreground "#5B6268" :background nil)
  (set-face-attribute 'org-level-1 nil :foreground "steelblue2" :background nil :height 1.2 :weight 'normal)
  (set-face-attribute 'org-level-2 nil :foreground "slategray2" :background nil :height 1.0 :weight 'normal)
  (set-face-attribute 'org-level-3 nil :foreground "SkyBlue2" :background nil :height 1.0 :weight 'normal)
  (set-face-attribute 'org-level-4 nil :foreground "DodgerBlue2" :background nil :height 1.0 :weight 'normal)
  (set-face-attribute 'org-level-5 nil :weight 'normal)
  (set-face-attribute 'org-level-6 nil :weight 'normal)
  (set-face-attribute 'org-document-title nil :foreground "SlateGray1" :background nil :height 1.75 :weight 'bold)
  (set-face-attribute 'org-document-title nil
                      :foreground "White"
                      :height 1.2
                      :weight 'bold)

  ;; 기본 단추들이 맘에 안들어서 커보이는 것들 순으로 다시 조정했다.
  (use-package org-bullets
    :init
    (setq org-bullets-bullet-list '("✸" "✸" "✸" "✸" "✸"))
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
  ;;기타 ORG모드 설정
  (use-package! org-mac-link
    :after org
    :config
    (setq
     org-mac-grab-Acrobat-app-p nil
     org-mac-grab-devonthink-app-p nil
     org-html-htmlize-output-type 'css
     org-download-method 'attach
     global-org-pretty-table-mode t)
    (map! :leader
          :map org-mode-map
          :desc "link from mac apps"
          "mlm"  #'org-mac-grab-link))
  )
#+END_SRC

** RSS Feed
*** Custom Elfeed Search Column
기본 피드 목록 화면은 한글 제목의 문자열 길이 계산에 버그가 있는지
컬럼 정렬이 뒤죽박죽이다.
그래서 컬럼 순서에서 제목 부분을 제일 뒤로 두어 깔끔하게 정렬되도록 한다.
구글링 해서 찾았음.
#+BEGIN_SRC elisp :tangle +custom_funcs.el
(defun feed-reader/search-print (entry)
      "Print ENTRY to the buffer."
      (let* ((feed-width 16)
              (tags-width 8)
              (title (or (elfeed-meta entry :title) (elfeed-entry-title entry) ""))
              (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
              (feed (elfeed-entry-feed entry))
              (feed-title
              (when feed
              (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
              (tags (mapcar #'symbol-name (elfeed-entry-tags entry)))
              (tags-str (concat "[" (mapconcat 'identity tags ",") "]"))
              (title-width (- (window-width) feed-width tags-width 4))
              (title-column (elfeed-format-column
                              title (elfeed-clamp
                              elfeed-search-title-min-width
                              title-width
                              elfeed-search-title-max-width)
                              :left))
              (tag-column (elfeed-format-column
                      tags-str (elfeed-clamp (length tags-str) tags-width tags-width)
                      :left))
              (feed-column (elfeed-format-column
                      feed-title (elfeed-clamp feed-width feed-width feed-width)
                      :left)))
      (insert (propertize feed-column 'face 'elfeed-search-feed-face) " ")
      (insert (propertize tag-column 'face 'elfeed-search-tag-face) " ")
      (insert (propertize title 'face title-faces 'kbd-help title))))

 (setq elfeed-search-print-entry-function #'feed-reader/search-print)
#+END_SRC

이맥스에서 RSS피드를 받아 보기에 편하다.
#+BEGIN_SRC elisp :tangle config.el
(setq elfeed-feeds '(
                     "http://www.bloter.net/feed"
                     "https://d2.naver.com/d2.atom"
                     "https://engineering.linecorp.com/ko/feed/"
                     "https://emacsredux.com/atom.xml"
                     "http://sachachua.com/blog/category/emacs/feed"
                     "https://planet.emacslife.com/atom.xml"
                     "https://www.emacswiki.org/emacs?action=rss;match=%5E%5Cd%5Cd%5Cd%5Cd-%5Cd%5Cd-%5Cd%5Cd"
                     "https://feeds.feedburner.com/zdkorea"
                     ))
#+END_SRC

** Utils
*** Ripgrep
rg.el 관련 설정.
#+BEGIN_SRC elisp :tangle config.el
(use-package rg
  :config
  (setq rg-group-result t
        rg-hide-command t
        rg-show-columns nil
        rg-show-header t
        rg-custom-type-aliases nil
        rg-default-alias-fallback "all")
  ;; 버퍼가 열리면 포커스를 그쪽으로 이동시킨다.
  ;; 이거 없으면 생각보다 귀찮아진다.
  (add-hook 'rg-mode-hook (lambda () (switch-to-buffer-other-window "*rg*"))))
#+END_SRC

*** Google, StackOverFlow Search
구글 검색, 각종 사이트 검색을 편리하게 하기 위한 간단한 유틸리티 함수들
구글링으로 찾았다.
#+BEGIN_SRC elisp :tangle +custom_funcs.el
(defun stackoverflow-search ()
"search keyword in google code search and stackoverflow.com"
    (interactive)
    (require 'w3m)
    (let ((keyword (w3m-url-encode-string (read-string "Enter Search Text: "))))
      (browse-url (concat "http://www.google.com/search?hl=en&q=" keyword "+site:stackoverflow.com")))
)

(defun google-search ()
"search word under cursor in google code search and google.com"
    (interactive)
    (require 'w3m)
    (let ((keyword (w3m-url-encode-string (read-string "Enter Search Text: "))))
      (browse-url (concat "http://www.google.com/search?hl=en&q=" keyword )))
)

#+END_SRC

*** Forge Custom Open Link
Forge에서 브라우저로 바로 열수 있는 함수를 사용한다.
#+BEGIN_SRC elisp :tangle +custom_funcs.el
(defun forge-custom-open-url ()
  (interactive)
  (if-let ((url (forge-get-url (or (forge-post-at-point)
                                   (forge-current-topic)))))
      (progn
        (message "Open Url: %S" url)
        (browse-url-generic url)))
  )
#+END_SRC

