config.el

;; start my org settings
;; config some hooks
(after! org
  (add-hook 'org-mode-hook 'my-org-config/after-org-mode-load)
  ;;basic org mode config
  (setq
   org-fontify-quote-and-verse-blocks nil
   org-fontify-whole-heading-line nil
   org-hide-leading-starts nil
   org-startup-indented nil
   org-hide-emphasis-markers t
   org-directory "~/org/"
   org-agenda-skip-scheduled-if-done t
   org-ellipsis " ▾ "
   org-tags-column -80
   org-agenda-span 30
   org-agenda-files '("~/org")
   org-log-done 'time
   org-refile-targets (quote ((nil :maxlevel . 1)))
   +org-capture-todo-file "tasks.org"
   org-edit-src-content-indentation 0
   org-src-tab-acts-natively t
   org-src-preserve-indentation t
   ;; config org-super-agenda
   org-super-agenda-mode t
   org-super-agenda-header-map nil
   org-deadline-warning-days 7
   org-agenda-skip-scheduled-if-done t
   org-agenda-block-separator 9472
   org-agenda-start-on-weekday nil
   org-super-agenda-groups '((:name "Today"
                              :time-grid t
                              :scheduled today)
                             (:name "Due today"
                              :deadline today)
                             (:name "Important"
                              :priority "A")
                             (:name "Overdue"
                              :deadline past)
                             (:name "Due soon"
                              :deadline future)))
  ;; org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕"))
  (set-face-attribute 'org-link nil :weight 'normal :background nil)
  (set-face-attribute 'org-code nil :foreground "#a9a1e1" :background nil)
  (set-face-attribute 'org-date nil :foreground "#5B6268" :background nil)
  (set-face-attribute 'org-level-1 nil :foreground "steelblue2" :background nil :height 1.2 :weight 'normal)
  (set-face-attribute 'org-level-2 nil :foreground "slategray2" :background nil :height 1.0 :weight 'normal)
  (set-face-attribute 'org-level-3 nil :foreground "SkyBlue2" :background nil :height 1.0 :weight 'normal)
  (set-face-attribute 'org-level-4 nil :foreground "DodgerBlue2" :background nil :height 1.0 :weight 'normal)
  (set-face-attribute 'org-level-5 nil :weight 'normal)
  (set-face-attribute 'org-level-6 nil :weight 'normal)
  (set-face-attribute 'org-document-title nil :foreground "SlateGray1" :background nil :height 1.75 :weight 'bold)
  (set-face-attribute 'org-document-title nil
                      :foreground "White"
                      :height 1.2
                      :weight 'bold)

  ;; 기본 단추들이 맘에 안들어서 커보이는 것들 순으로 다시 조정했다.
  (use-package org-bullets
    :init
    (setq org-bullets-bullet-list '("✸" "✸" "✸" "✸" "✸"))
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
  ;;기타 ORG모드 설정
  (use-package! org-mac-link
    :after org
    :config
    (setq
     org-mac-grab-Acrobat-app-p nil
     org-mac-grab-devonthink-app-p nil
     org-html-htmlize-output-type 'css
     org-download-method 'attach
     global-org-pretty-table-mode t)
    (map! :leader
          :map org-mode-map
          :desc "link from mac apps"
          "mlm"  #'org-mac-grab-link))
  )

(setq elfeed-feeds '(
    "http://www.bloter.net/feed"
    "https://d2.naver.com/d2.atom"
    "https://engineering.linecorp.com/ko/feed/"
    "https://tech.lezhin.com/rss/"
    "https://emacsredux.com/atom.xml"
    "http://sachachua.com/blog/category/emacs/feed"
    "https://planet.emacslife.com/atom.xml"
    "https://www.emacswiki.org/emacs?action=rss;match=%5E%5Cd%5Cd%5Cd%5Cd-%5Cd%5Cd-%5Cd%5Cd"
    "https://feeds.feedburner.com/zdkorea"
    "https://www.reddit.com/r/linux.rss"
))

(use-package rg
  :config
  (setq rg-group-result t
        rg-hide-command t
        rg-show-columns nil
        rg-show-header t
        rg-custom-type-aliases nil
        rg-default-alias-fallback "all")
  ;; 버퍼가 열리면 포커스를 그쪽으로 이동시킨다.
  ;; 이거 없으면 생각보다 귀찮아진다.
  (add-hook 'rg-mode-hook (lambda () (switch-to-buffer-other-window "*rg*"))))
