README.org
*** Toggle Window Layout
윈도우를 두개로 나누었을때 가로, 세로 나누기로 변경하는 함수.
#+BEGIN_SRC elisp :tangle +custom_funcs.el
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))
#+END_SRC

** ETC
*** Shell Utils
쉘 설정 파일을 바로 불어 올 수 있는 함수.
단축기와 연동하여 사용한다.
zsh관련 설정 파일을 만질 일이 있을때 요긴하게 잘 사용한다.
#+BEGIN_SRC elisp :tangle +custom_funcs.el
(defun er-find-alacritty-init-file ()
  "Edit the shell init file in another window."
  (interactive)
    (find-file-other-window (expand-file-name ".config/alacritty/alacritty.yml" (getenv "HOME"))))

(defun er-find-shell-init-file ()
  "Edit the shell init file in another window."
  (interactive)
  (let* ((shell (car (reverse (split-string (getenv "SHELL") "/"))))
         (shell-init-file (cond
                           ((string-equal "zsh" shell) ".zshrc")
                           ((string-equal "bash" shell) ".bashrc")
                           (t (error "Unknown shell")))))
    (find-file-other-window (expand-file-name shell-init-file (getenv "HOME")))))
#+END_SRC

*** Custom Variables
#+BEGIN_SRC elisp :tangle custom.el
(custom-set-variables
 '(warning-suppress-types '((initialization) (lsp-mode))))
(custom-set-faces
 )
#+END_SRC
